xpacks/stm32f7-cmsis/CMSIS/Driver/OTG_HS_STM32F7xx.h
// Pin USB_OTG_HS_ULPI_D5 : PB12
#define MX_USB_OTG_HS_ULPI_D5_Pin               PB12
#define MX_USB_OTG_HS_ULPI_D5_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D5_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D5_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D5_GPIOx             RTE_USB_OTG_HS_ULPI_D5_PORT
#define MX_USB_OTG_HS_ULPI_D5_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D5_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D5_PIN)

// Pin USB_OTG_HS_ULPI_D6 : PB13
#define MX_USB_OTG_HS_ULPI_D6_Pin               PB13
#define MX_USB_OTG_HS_ULPI_D6_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D6_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D6_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D6_GPIOx             RTE_USB_OTG_HS_ULPI_D6_PORT
#define MX_USB_OTG_HS_ULPI_D6_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D6_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D6_PIN)

#else                                           // On-chip Full-speed PHY

// Pin USB_OTG_HS_ID : PB12
#define MX_USB_OTG_HS_ID_Pin                    PB12
#define MX_USB_OTG_HS_ID_GPIO_AF                GPIO_AF12_OTG_HS_FS
#define MX_USB_OTG_HS_ID_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_HS_ID_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_HS_ID_GPIOx                  GPIOB
#define MX_USB_OTG_HS_ID_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ID_GPIO_Pin               GPIO_PIN_12

// Pin USB_OTG_HS_DM : PB14
#define MX_USB_OTG_HS_DM_Pin                    PB14
#define MX_USB_OTG_HS_DM_GPIO_AF                GPIO_AF12_OTG_HS_FS
#define MX_USB_OTG_HS_DM_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_HS_DM_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_HS_DM_GPIOx                  GPIOB
#define MX_USB_OTG_HS_DM_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_DM_GPIO_Pin               GPIO_PIN_14

// Pin USB_OTG_HS_DP : PB15
#define MX_USB_OTG_HS_DP_Pin                    PB15
#define MX_USB_OTG_HS_DP_GPIO_AF                GPIO_AF12_OTG_HS_FS
#define MX_USB_OTG_HS_DP_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_HS_DP_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_HS_DP_GPIOx                  GPIOB
#define MX_USB_OTG_HS_DP_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_DP_GPIO_Pin               GPIO_PIN_15

// Pin USB_OTG_HS_VBUS : PB13
#define MX_USB_OTG_HS_VBUS_Pin                  PB13
#define MX_USB_OTG_HS_VBUS_GPIO_PuPd            GPIO_NOPULL
#define MX_USB_OTG_HS_VBUS_GPIOx                GPIOB
#define MX_USB_OTG_HS_VBUS_GPIO_Mode            GPIO_MODE_INPUT
#define MX_USB_OTG_HS_VBUS_GPIO_Pin             GPIO_PIN_13

#endif

#if    ((RTE_USB_OTG_HS_HOST == 1) && (RTE_OTG_HS_VBUS_PIN == 1))
// Pin USB_OTG_HS_VBUS_Power : GPIO pin
#define MX_USB_OTG_HS_VBUS_Power_Pin            1
#define MX_USB_OTG_HS_VBUS_Power_GPIO_PuPd      GPIO_NOPULL
#define MX_USB_OTG_HS_VBUS_Power_GPIOx          RTE_OTG_HS_VBUS_PORT
#define MX_USB_OTG_HS_VBUS_Power_GPIO_Mode      GPIO_MODE_OUTPUT_PP
#define MX_USB_OTG_HS_VBUS_Power_GPIO_Pin       MX_USB_OTG_HS_GPIO_PIN(RTE_OTG_HS_VBUS_BIT)
#define    USB_OTG_HS_VBUS_Power_Pin_Active     RTE_OTG_HS_VBUS_ACTIVE
#endif

#if    ((RTE_USB_OTG_HS_HOST == 1) && (RTE_OTG_HS_OC_PIN == 1))
// Pin USB_OTG_HS_Overcurrent : GPIO pin
#define MX_USB_OTG_HS_Overcurrent_Pin           1
#define MX_USB_OTG_HS_Overcurrent_GPIO_PuPd     GPIO_NOPULL
#define MX_USB_OTG_HS_Overcurrent_GPIOx         RTE_OTG_HS_OC_PORT
#define MX_USB_OTG_HS_Overcurrent_GPIO_Mode     GPIO_MODE_INPUT
#define MX_USB_OTG_HS_Overcurrent_GPIO_Pin      MX_USB_OTG_HS_GPIO_PIN(RTE_OTG_HS_OC_BIT)
#define    USB_OTG_HS_Overcurrent_Pin_Active    RTE_OTG_HS_OC_ACTIVE
#endif

// USB_OTG_HS DMA usage
#ifndef    RTE_OTG_HS_DMA
#define    RTE_OTG_HS_DMA                       0
#endif
#define    USB_OTG_HS_DMA                       RTE_OTG_HS_DMA

#elif  (defined(RTE_DEVICE_FRAMEWORK_CUBE_MX))  // #ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
#include "MX_Device.h"

#define CREATE_MX_SYMBOL(mx_def,ext)            MX_##mx_def##_##ext
#define MX_VAL(mx_def,ext)                      CREATE_MX_SYMBOL(mx_def,ext)

// Do basic CubeMX configuration check
#ifndef MX_USB_OTG_HS
#error  Enable USB_OTG_HS in STM32CubeMX!
#endif

#if     defined(MX_USB_OTG_HS_VBUS_Power)
// Pin USB_OTG_HS_VBUS_Power : GPIO pin
#define MX_USB_OTG_HS_VBUS_Power_Pin            1
#define MX_USB_OTG_HS_VBUS_Power_GPIO_PuPd      MX_VAL(MX_USB_OTG_HS_VBUS_Power, GPIO_PuPd)
#define MX_USB_OTG_HS_VBUS_Power_GPIOx          MX_VAL(MX_USB_OTG_HS_VBUS_Power, GPIOx)
#define MX_USB_OTG_HS_VBUS_Power_GPIO_Mode      MX_VAL(MX_USB_OTG_HS_VBUS_Power, GPIO_ModeDefaultOutputPP)
#define MX_USB_OTG_HS_VBUS_Power_GPIO_Pin       MX_VAL(MX_USB_OTG_HS_VBUS_Power, GPIO_Pin)
#ifndef    USB_OTG_HS_VBUS_Power_Pin_Active
#define    USB_OTG_HS_VBUS_Power_Pin_Active     0
#endif
#endif

#if     defined(MX_USB_OTG_HS_Overcurrent)
// Pin USB_OTG_HS_Overcurrent : GPIO pin
#define MX_USB_OTG_HS_Overcurrent_Pin           1
#define MX_USB_OTG_HS_Overcurrent_GPIO_PuPd     MX_VAL(MX_USB_OTG_HS_Overcurrent, GPIO_PuPd)
#define MX_USB_OTG_HS_Overcurrent_GPIOx         MX_VAL(MX_USB_OTG_HS_Overcurrent, GPIOx)
#define MX_USB_OTG_HS_Overcurrent_GPIO_Mode     MX_VAL(MX_USB_OTG_HS_Overcurrent, Mode)
#define MX_USB_OTG_HS_Overcurrent_GPIO_Pin      MX_VAL(MX_USB_OTG_HS_Overcurrent, GPIO_Pin)
#ifndef    USB_OTG_HS_Overcurrent_Pin_Active
#define    USB_OTG_HS_Overcurrent_Pin_Active    0
#endif
#endif

#ifndef    USB_OTG_HS_DMA
#define    USB_OTG_HS_DMA                       0
#endif

#endif                                          // #ifdef RTE_DEVICE_FRAMEWORK_CLASSIC

#pragma push
#pragma anon_unions

// OTG_HS
typedef struct
{
  __IO uint32_t GOTGCTL;
  __IO uint32_t GOTGINT;
  __IO uint32_t GAHBCFG;
  __IO uint32_t GUSBCFG;
  __IO uint32_t GRSTCTL;
  __IO uint32_t GINTSTS;
  __IO uint32_t GINTMSK;
  __IO uint32_t GRXSTSR;
  __IO uint32_t GRXSTSP;
  __IO uint32_t GRXFSIZ;
  union {
    __IO uint32_t HNPTXFSIZ;
    __IO uint32_t DIEPTXF0;
  };
  __IO uint32_t HNPTXSTS;
  __IO uint32_t GI2CCTL;
       uint32_t RESERVED0;
  __IO uint32_t GCCFG;
  __IO uint32_t CID;
       uint32_t RESERVED1[48];
  __IO uint32_t HPTXFSIZ;
  __IO uint32_t DIEPTXF1;
  __IO uint32_t DIEPTXF2;
  __IO uint32_t DIEPTXF3;
  __IO uint32_t DIEPTXF4;
  __IO uint32_t DIEPTXF5;
  __IO uint32_t DIEPTXF6;
  __IO uint32_t DIEPTXF7;
  __IO uint32_t DIEPTXF8;
  __IO uint32_t DIEPTXF9;
  __IO uint32_t DIEPTXF10;
  __IO uint32_t DIEPTXF11;
  __IO uint32_t DIEPTXF12;
  __IO uint32_t DIEPTXF13;
  __IO uint32_t DIEPTXF14;
  __IO uint32_t DIEPTXF15;
       uint32_t RESERVED2[176];
  __IO uint32_t HCFG;
  __IO uint32_t HFIR;
  __IO uint32_t HFNUM;
       uint32_t RESERVED3;
  __IO uint32_t HPTXSTS;
  __IO uint32_t HAINT;
  __IO uint32_t HAINTMSK;
       uint32_t RESERVED4[9];
  __IO uint32_t HPRT;
       uint32_t RESERVED5[47];
  __IO uint32_t HCCHAR0;
  __IO uint32_t HCSPLT0;
  __IO uint32_t HCINT0;
  __IO uint32_t HCINTMSK0;
  __IO uint32_t HCTSIZ0;
  __IO uint32_t HCDMA0;
       uint32_t RESERVED6[2];
  __IO uint32_t HCCHAR1;
  __IO uint32_t HCSPLT1;
  __IO uint32_t HCINT1;
  __IO uint32_t HCINTMSK1;
  __IO uint32_t HCTSIZ1;
  __IO uint32_t HCDMA1;
       uint32_t RESERVED7[2];
  __IO uint32_t HCCHAR2;
  __IO uint32_t HCSPLT2;
  __IO uint32_t HCINT2;
  __IO uint32_t HCINTMSK2;
  __IO uint32_t HCTSIZ2;
  __IO uint32_t HCDMA2;
       uint32_t RESERVED8[2];
  __IO uint32_t HCCHAR3;
  __IO uint32_t HCSPLT3;
  __IO uint32_t HCINT3;
  __IO uint32_t HCINTMSK3;
  __IO uint32_t HCTSIZ3;
  __IO uint32_t HCDMA3;
       uint32_t RESERVED9[2];
  __IO uint32_t HCCHAR4;
  __IO uint32_t HCSPLT4;
  __IO uint32_t HCINT4;
  __IO uint32_t HCINTMSK4;
  __IO uint32_t HCTSIZ4;
  __IO uint32_t HCDMA4;
       uint32_t RESERVED10[2];
  __IO uint32_t HCCHAR5;
  __IO uint32_t HCSPLT5;
  __IO uint32_t HCINT5;
  __IO uint32_t HCINTMSK5;
  __IO uint32_t HCTSIZ5;
  __IO uint32_t HCDMA5;
       uint32_t RESERVED11[2];
  __IO uint32_t HCCHAR6;
  __IO uint32_t HCSPLT6;
  __IO uint32_t HCINT6;
  __IO uint32_t HCINTMSK6;
  __IO uint32_t HCTSIZ6;
  __IO uint32_t HCDMA6;
       uint32_t RESERVED12[2];
  __IO uint32_t HCCHAR7;
  __IO uint32_t HCSPLT7;
  __IO uint32_t HCINT7;
  __IO uint32_t HCINTMSK7;
  __IO uint32_t HCTSIZ7;
  __IO uint32_t HCDMA7;
       uint32_t RESERVED13[2];
  __IO uint32_t HCCHAR8;
  __IO uint32_t HCSPLT8;
  __IO uint32_t HCINT8;
  __IO uint32_t HCINTMSK8;
  __IO uint32_t HCTSIZ8;
  __IO uint32_t HCDMA8;
       uint32_t RESERVED14[2];
  __IO uint32_t HCCHAR9;
  __IO uint32_t HCSPLT9;
  __IO uint32_t HCINT9;
  __IO uint32_t HCINTMSK9;
  __IO uint32_t HCTSIZ9;
  __IO uint32_t HCDMA9;
       uint32_t RESERVED15[2];
  __IO uint32_t HCCHAR10;
  __IO uint32_t HCSPLT10;
  __IO uint32_t HCINT10;
  __IO uint32_t HCINTMSK10;
  __IO uint32_t HCTSIZ10;
  __IO uint32_t HCDMA10;
       uint32_t RESERVED16[2];
  __IO uint32_t HCCHAR11;
  __IO uint32_t HCSPLT11;
  __IO uint32_t HCINT11;
  __IO uint32_t HCINTMSK11;
  __IO uint32_t HCTSIZ11;
  __IO uint32_t HCDMA11;
       uint32_t RESERVED17[2];
  __IO uint32_t HCCHAR12;
  __IO uint32_t HCSPLT12;
  __IO uint32_t HCINT12;
  __IO uint32_t HCINTMSK12;
  __IO uint32_t HCTSIZ12;
  __IO uint32_t HCDMA12;
       uint32_t RESERVED18[2];
  __IO uint32_t HCCHAR13;
  __IO uint32_t HCSPLT13;
  __IO uint32_t HCINT13;
  __IO uint32_t HCINTMSK13;
  __IO uint32_t HCTSIZ13;
  __IO uint32_t HCDMA13;
       uint32_t RESERVED19[2];
  __IO uint32_t HCCHAR14;
  __IO uint32_t HCSPLT14;
  __IO uint32_t HCINT14;
  __IO uint32_t HCINTMSK14;
  __IO uint32_t HCTSIZ14;
  __IO uint32_t HCDMA14;
       uint32_t RESERVED20[2];
  __IO uint32_t HCCHAR15;
  __IO uint32_t HCSPLT15;
  __IO uint32_t HCINT15;
  __IO uint32_t HCINTMSK15;
  __IO uint32_t HCTSIZ15;
  __IO uint32_t HCDMA15;
       uint32_t RESERVED21[2];
       uint32_t RESERVED22[64];
  __IO uint32_t DCFG;
  __IO uint32_t DCTL;
  __IO uint32_t DSTS;
       uint32_t RESERVED23;
  __IO uint32_t DIEPMSK;
  __IO uint32_t DOEPMSK;
  __IO uint32_t DAINT;
  __IO uint32_t DAINTMSK;
       uint32_t RESERVED24[2];
  __IO uint32_t DVBUSDIS;
  __IO uint32_t DVBUSPULSE;
  __IO uint32_t DTHRCTL;
  __IO uint32_t DIEPEMPMSK;
  __IO uint32_t DEACHINT;
  __IO uint32_t DEACHINTMSK;
       uint32_t RESERVED26[48];
  __IO uint32_t DIEPCTL0;
       uint32_t RESERVED28;
  __IO uint32_t DIEPINT0;
       uint32_t RESERVED29;
  __IO uint32_t DIEPTSIZ0;
  __IO uint32_t DIEPDMA0;
  __IO uint32_t DTXFSTS0;
       uint32_t RESERVED30;
  __IO uint32_t DIEPCTL1;
       uint32_t RESERVED31;
  __IO uint32_t DIEPINT1;
       uint32_t RESERVED32;
  __IO uint32_t DIEPTSIZ1;
  __IO uint32_t DIEPDMA1;
  __IO uint32_t DTXFSTS1;
       uint32_t RESERVED33;
  __IO uint32_t DIEPCTL2;
       uint32_t RESERVED34;
  __IO uint32_t DIEPINT2;
       uint32_t RESERVED35;
  __IO uint32_t DIEPTSIZ2;
  __IO uint32_t DIEPDMA2;
  __IO uint32_t DTXFSTS2;
       uint32_t RESERVED36;
  __IO uint32_t DIEPCTL3;
       uint32_t RESERVED37;
  __IO uint32_t DIEPINT3;
       uint32_t RESERVED38;
  __IO uint32_t DIEPTSIZ3;
  __IO uint32_t DIEPDMA3;
  __IO uint32_t DTXFSTS3;
       uint32_t RESERVED39;
  __IO uint32_t DIEPCTL4;
       uint32_t RESERVED40;
  __IO uint32_t DIEPINT4;
       uint32_t RESERVED41;
  __IO uint32_t DIEPTSIZ4;
  __IO uint32_t DIEPDMA4;
  __IO uint32_t DTXFSTS4;
       uint32_t RESERVED42;
  __IO uint32_t DIEPCTL5;
       uint32_t RESERVED43;
  __IO uint32_t DIEPINT5;
       uint32_t RESERVED44;
  __IO uint32_t DIEPTSIZ5;
  __IO uint32_t DIEPDMA5;
  __IO uint32_t DTXFSTS5;
       uint32_t RESERVED45;
  __IO uint32_t DIEPCTL6;
       uint32_t RESERVED46;
  __IO uint32_t DIEPINT6;
       uint32_t RESERVED47;
  __IO uint32_t DIEPTSIZ6;
  __IO uint32_t DIEPDMA6;
  __IO uint32_t DTXFSTS6;
       uint32_t RESERVED48;
  __IO uint32_t DIEPCTL7;
       uint32_t RESERVED49;
  __IO uint32_t DIEPINT7;
       uint32_t RESERVED50;
  __IO uint32_t DIEPTSIZ7;
  __IO uint32_t DIEPDMA7;
  __IO uint32_t DTXFSTS7;
       uint32_t RESERVED51;
  __IO uint32_t DIEPCTL8;
       uint32_t RESERVED52;
  __IO uint32_t DIEPINT8;
       uint32_t RESERVED53;
  __IO uint32_t DIEPTSIZ8;
  __IO uint32_t DIEPDMA8;
  __IO uint32_t DTXFSTS8;
       uint32_t RESERVED54;
  __IO uint32_t DIEPCTL9;
       uint32_t RESERVED55;
  __IO uint32_t DIEPINT9;
       uint32_t RESERVED56;
  __IO uint32_t DIEPTSIZ9;
  __IO uint32_t DIEPDMA9;
  __IO uint32_t DTXFSTS9;
       uint32_t RESERVED57;
  __IO uint32_t DIEPCTL10;
       uint32_t RESERVED58;
  __IO uint32_t DIEPINT10;
       uint32_t RESERVED59;
  __IO uint32_t DIEPTSIZ10;
  __IO uint32_t DIEPDMA10;
  __IO uint32_t DTXFSTS10;
       uint32_t RESERVED60;
  __IO uint32_t DIEPCTL11;
       uint32_t RESERVED61;
  __IO uint32_t DIEPINT11;
       uint32_t RESERVED62;
  __IO uint32_t DIEPTSIZ11;
  __IO uint32_t DIEPDMA11;
  __IO uint32_t DTXFSTS11;
       uint32_t RESERVED63;
  __IO uint32_t DIEPCTL12;
       uint32_t RESERVED64;
  __IO uint32_t DIEPINT12;
       uint32_t RESERVED65;
  __IO uint32_t DIEPTSIZ12;
  __IO uint32_t DIEPDMA12;
  __IO uint32_t DTXFSTS12;
       uint32_t RESERVED66;
  __IO uint32_t DIEPCTL13;
       uint32_t RESERVED67;
  __IO uint32_t DIEPINT13;
       uint32_t RESERVED68;
  __IO uint32_t DIEPTSIZ13;
  __IO uint32_t DIEPDMA13;
  __IO uint32_t DTXFSTS13;
       uint32_t RESERVED69;
  __IO uint32_t DIEPCTL14;
       uint32_t RESERVED70;
  __IO uint32_t DIEPINT14;
       uint32_t RESERVED71;
  __IO uint32_t DIEPTSIZ14;
  __IO uint32_t DIEPDMA14;
  __IO uint32_t DTXFSTS14;
       uint32_t RESERVED72;
  __IO uint32_t DIEPCTL15;
       uint32_t RESERVED73;
  __IO uint32_t DIEPINT15;
       uint32_t RESERVED74;
  __IO uint32_t DIEPTSIZ15;
  __IO uint32_t DIEPDMA15;
  __IO uint32_t DTXFSTS15;
       uint32_t RESERVED75;
  __IO uint32_t DOEPCTL0;
       uint32_t RESERVED76;
  __IO uint32_t DOEPINT0;
       uint32_t RESERVED77;
  __IO uint32_t DOEPTSIZ0;
  __IO uint32_t DOEPDMAB0;
       uint32_t RESERVED78[2];
  __IO uint32_t DOEPCTL1;
       uint32_t RESERVED79;
  __IO uint32_t DOEPINT1;
       uint32_t RESERVED80;
  __IO uint32_t DOEPTSIZ1;
  __IO uint32_t DOEPDMAB1;
       uint32_t RESERVED81[2];
  __IO uint32_t DOEPCTL2;
       uint32_t RESERVED82;
  __IO uint32_t DOEPINT2;
       uint32_t RESERVED83;
  __IO uint32_t DOEPTSIZ2;
  __IO uint32_t DOEPDMAB2;
       uint32_t RESERVED84[2];
  __IO uint32_t DOEPCTL3;
       uint32_t RESERVED85;
  __IO uint32_t DOEPINT3;
       uint32_t RESERVED86;
  __IO uint32_t DOEPTSIZ3;
  __IO uint32_t DOEPDMAB3;
       uint32_t RESERVED87[2];
  __IO uint32_t DOEPCTL4;
       uint32_t RESERVED88;
  __IO uint32_t DOEPINT4;
       uint32_t RESERVED89;
  __IO uint32_t DOEPTSIZ4;
  __IO uint32_t DOEPDMAB4;
       uint32_t RESERVED90[2];
  __IO uint32_t DOEPCTL5;
       uint32_t RESERVED91;
  __IO uint32_t DOEPINT5;
       uint32_t RESERVED92;
  __IO uint32_t DOEPTSIZ5;
  __IO uint32_t DOEPDMAB5;
       uint32_t RESERVED93[2];
  __IO uint32_t DOEPCTL6;
       uint32_t RESERVED94;
  __IO uint32_t DOEPINT6;
       uint32_t RESERVED95;
  __IO uint32_t DOEPTSIZ6;
  __IO uint32_t DOEPDMAB6;
       uint32_t RESERVED96[2];
  __IO uint32_t DOEPCTL7;
       uint32_t RESERVED97;
  __IO uint32_t DOEPINT7;
       uint32_t RESERVED98;
  __IO uint32_t DOEPTSIZ7;
  __IO uint32_t DOEPDMAB7;
       uint32_t RESERVED99[2];
  __IO uint32_t DOEPCTL8;
       uint32_t RESERVED100;
  __IO uint32_t DOEPINT8;
       uint32_t RESERVED101;
  __IO uint32_t DOEPTSIZ8;
  __IO uint32_t DOEPDMAB8;
       uint32_t RESERVED102[2];
  __IO uint32_t DOEPCTL9;
       uint32_t RESERVED103;
  __IO uint32_t DOEPINT9;
       uint32_t RESERVED104;
  __IO uint32_t DOEPTSIZ9;
  __IO uint32_t DOEPDMAB9;
       uint32_t RESERVED105[2];
  __IO uint32_t DOEPCTL10;
       uint32_t RESERVED106;
  __IO uint32_t DOEPINT10;
       uint32_t RESERVED107;
  __IO uint32_t DOEPTSIZ10;
  __IO uint32_t DOEPDMAB10;
       uint32_t RESERVED108[2];
  __IO uint32_t DOEPCTL11;
       uint32_t RESERVED109;
  __IO uint32_t DOEPINT11;
       uint32_t RESERVED110;
  __IO uint32_t DOEPTSIZ11;
  __IO uint32_t DOEPDMAB11;
       uint32_t RESERVED111[2];
  __IO uint32_t DOEPCTL12;
       uint32_t RESERVED112;
  __IO uint32_t DOEPINT12;
       uint32_t RESERVED113;
  __IO uint32_t DOEPTSIZ12;
  __IO uint32_t DOEPDMAB12;
       uint32_t RESERVED114[2];
  __IO uint32_t DOEPCTL13;
       uint32_t RESERVED115;
  __IO uint32_t DOEPINT13;
       uint32_t RESERVED116;
  __IO uint32_t DOEPTSIZ13;
  __IO uint32_t DOEPDMAB13;
       uint32_t RESERVED117[2];
  __IO uint32_t DOEPCTL14;
       uint32_t RESERVED118;
  __IO uint32_t DOEPINT14;
       uint32_t RESERVED119;
  __IO uint32_t DOEPTSIZ14;
  __IO uint32_t DOEPDMAB14;
       uint32_t RESERVED120[2];
  __IO uint32_t DOEPCTL15;
       uint32_t RESERVED121;
  __IO uint32_t DOEPINT15;
       uint32_t RESERVED122;
  __IO uint32_t DOEPTSIZ15;
  __IO uint32_t DOEPDMAB15;
       uint32_t RESERVED123[2];
       uint32_t RESERVED143[64];
  __IO uint32_t PCGCCTL;
} OTG_HS_TypeDef;

#define OTG_HS_BASE           (AHB1PERIPH_BASE + 0x20000U)
#define OTG_HS_DFIFO0_BASE    (OTG_HS_BASE + 0x01000U)
#define OTG_HS_DFIFO1_BASE    (OTG_HS_BASE + 0x02000U)
#define OTG_HS_DFIFO2_BASE    (OTG_HS_BASE + 0x03000U)
#define OTG_HS_DFIFO3_BASE    (OTG_HS_BASE + 0x04000U)
#define OTG_HS_DFIFO4_BASE    (OTG_HS_BASE + 0x05000U)
#define OTG_HS_DFIFO5_BASE    (OTG_HS_BASE + 0x06000U)
#define OTG_HS_DFIFO6_BASE    (OTG_HS_BASE + 0x07000U)
#define OTG_HS_DFIFO7_BASE    (OTG_HS_BASE + 0x08000U)
#define OTG_HS_DFIFO8_BASE    (OTG_HS_BASE + 0x09000U)
#define OTG_HS_DFIFO9_BASE    (OTG_HS_BASE + 0x0A000U)
#define OTG_HS_DFIFO10_BASE   (OTG_HS_BASE + 0x0B000U)
#define OTG_HS_DFIFO11_BASE   (OTG_HS_BASE + 0x0C000U)
#define OTG_HS_DFIFO12_BASE   (OTG_HS_BASE + 0x0D000U)
#define OTG_HS_DFIFO13_BASE   (OTG_HS_BASE + 0x0E000U)
#define OTG_HS_DFIFO14_BASE   (OTG_HS_BASE + 0x0F000U)
#define OTG_HS_DFIFO15_BASE   (OTG_HS_BASE + 0x10000U)

#define OTG_HS                ((OTG_HS_TypeDef *) OTG_HS_BASE)
#define OTG_HS_DFIFO0         (((uint32_t *) OTG_HS_DFIFO0_BASE) )
#define OTG_HS_DFIFO1         (((uint32_t *) OTG_HS_DFIFO1_BASE) )
#define OTG_HS_DFIFO2         (((uint32_t *) OTG_HS_DFIFO2_BASE) )
#define OTG_HS_DFIFO3         (((uint32_t *) OTG_HS_DFIFO3_BASE) )
#define OTG_HS_DFIFO4         (((uint32_t *) OTG_HS_DFIFO4_BASE) )
#define OTG_HS_DFIFO5         (((uint32_t *) OTG_HS_DFIFO5_BASE) )
#define OTG_HS_DFIFO6         (((uint32_t *) OTG_HS_DFIFO6_BASE) )
#define OTG_HS_DFIFO7         (((uint32_t *) OTG_HS_DFIFO7_BASE) )
#define OTG_HS_DFIFO8         (((uint32_t *) OTG_HS_DFIFO8_BASE) )
#define OTG_HS_DFIFO9         (((uint32_t *) OTG_HS_DFIFO9_BASE) )
#define OTG_HS_DFIFO10        (((uint32_t *) OTG_HS_DFIFO10_BASE))
#define OTG_HS_DFIFO11        (((uint32_t *) OTG_HS_DFIFO11_BASE))
#define OTG_HS_DFIFO12        (((uint32_t *) OTG_HS_DFIFO12_BASE))
#define OTG_HS_DFIFO13        (((uint32_t *) OTG_HS_DFIFO13_BASE))
#define OTG_HS_DFIFO14        (((uint32_t *) OTG_HS_DFIFO14_BASE))
#define OTG_HS_DFIFO15        (((uint32_t *) OTG_HS_DFIFO15_BASE))

// OTG_HS Host Channel
typedef struct __attribute__((packed)) {// Host Channel typedef (HC)
  union __attribute__((packed)) {
    uint32_t HCCHAR;                    // Channel Characteristics
    struct __attribute__((packed)) {
      uint32_t MPSIZ     : 11;          // Endpoint Maximum Packet Size
      uint32_t EPNUM     :  4;          // Endpoint Number
      uint32_t EPDIR     :  1;          // Endpoint Direction
      uint32_t Reserved0 :  1;          // Reserved
      uint32_t LSDEV     :  1;          // Endpoint Low-speed
      uint32_t EPTYP     :  2;          // Endpoint Type
      uint32_t MCNT      :  2;          // Multicount
      uint32_t DAD       :  7;          // Device Address
      uint32_t ODDFRM    :  1;          // Periodic Transaction Odd Frame
      uint32_t CHDIS     :  1;          // Channel Disable
      uint32_t CHENA     :  1;          // Channel Enable
    };
  };
  union __attribute__((packed)) {
    uint32_t HCSPLT;                    // Split Control
    struct __attribute__((packed)) {
      uint32_t PRTADDR   :  7;          // Port Address
      uint32_t HUBADDR   :  7;          // HUB Address
      uint32_t XACTPOS   :  2;          // Transaction Position
      uint32_t COMPLSPLT :  1;          // Do Complete Split
      uint32_t Reserved1 : 14;          // Reserved
      uint32_t SPLITEN   :  1;          // Split Enable
    };
  };

  union __attribute__((packed)) {
    uint32_t HCINT;                     // Channel Interrupt
    struct __attribute__((packed)) {
      uint32_t XFCR      :  1;          // Transfer Completed
      uint32_t CHH       :  1;          // Channel Halted
      uint32_t AHBERR    :  1;          // AHB Error
      uint32_t STALL     :  1;          // STALL Response Received Interrupt
      uint32_t NAK       :  1;          // NAK Response Received Interrupt
      uint32_t ACK       :  1;          // ACK Response Rece/Transmit Int
      uint32_t NYET      :  1;          // NYET Response Received Interrupt
      uint32_t TXERR     :  1;          // Transaction Error
      uint32_t BBERR     :  1;          // Babble Error
      uint32_t FRMOR     :  1;          // Frame Overrun
      uint32_t DTERR     :  1;          // Data Toggle Error
    };
  };
  union __attribute__((packed)) {
    uint32_t HCINTMSK;                  // Channel Interrupt Mask
    struct __attribute__((packed)) {
      uint32_t XFCRM     :  1;          // Transfer Completed Mask
      uint32_t CHHM      :  1;          // Channel Halted Mask
      uint32_t AHBERRM   :  1;          // AHB Error
      uint32_t STALLM    :  1;          // STALL Response Rece Interrupt Mask
      uint32_t NAKM      :  1;          // NAK Response Rece Interrupt Mask
      uint32_t ACKM      :  1;          // ACK Response Rece/Transmit Int Mask
      uint32_t NYETM     :  1;          // NYET Response Rece/Transmit Int Msk
      uint32_t TXERRM    :  1;          // Transaction Error Mask
      uint32_t BBERRM    :  1;          // Babble Error Mask
      uint32_t FRMORM    :  1;          // Frame Overrun Mask
      uint32_t DTERRM    :  1;          // Data Toggle Error Mask
    };
  };
  union __attribute__((packed)) {
    uint32_t HCTSIZ;                    // Channel Transfer Size
    struct __attribute__((packed)) {
      uint32_t XFRSIZ    : 19;          // Transfer Size
      uint32_t PKTCNT    : 10;          // Packet Count
      uint32_t DPID      :  2;          // Data PID
      uint32_t DOPING    :  1;          // Do Pingd
    };
  };
  uint32_t DMAADDR;                     // DMA Address
  uint32_t Reserved8;                   // Reserved
  uint32_t Reserved9;                   // Reserved
} OTG_HS_HC;

