xpacks/stm32f7-cmsis/CMSIS/Driver/OTG_HS_STM32F7xx.h
// OTG_HS Host non-periodic transmit FIFO size register (OTG_HS_HNPTXFSIZ)
#define  OTG_HS_HNPTXFSIZ_NPTXFSA_POS       ((uint32_t)           0U)
#define  OTG_HS_HNPTXFSIZ_NPTXFSA_MSK       ((uint32_t)0xFFFFU      )
#define  OTG_HS_HNPTXFSIZ_NPTXFSA(x)       (((uint32_t)    x        ) & OTG_HS_HNPTXFSIZ_NPTXFSA_MSK)
#define  OTG_HS_HNPTXFSIZ_NPTXFD_POS        ((uint32_t)           16U)
#define  OTG_HS_HNPTXFSIZ_NPTXFD_MSK        ((uint32_t)0xFFFFU << OTG_HS_HNPTXFSIZ_NPTXFD_POS)
#define  OTG_HS_HNPTXFSIZ_NPTXFD(x)        (((uint32_t)    x   << OTG_HS_HNPTXFSIZ_NPTXFD_POS) & OTG_HS_HNPTXFSIZ_NPTXFD_MSK)

// OTG_HS Endpoint 0 transmit FIFO size register (OTG_HS_DIEPTXF0)
#define  OTG_HS_DIEPTXF0_TX0FSA_POS         ((uint32_t)           0U)
#define  OTG_HS_DIEPTXF0_TX0FSA_MSK         ((uint32_t)0xFFFFU      )
#define  OTG_HS_DIEPTXF0_TX0FSA(x)         (((uint32_t)    x        ) & OTG_HS_DIEPTXF0_TX0FSA_MSK)
#define  OTG_HS_DIEPTXF0_TX0FD_POS          ((uint32_t)           16U)
#define  OTG_HS_DIEPTXF0_TX0FD_MSK          ((uint32_t)0xFFFFU << OTG_HS_DIEPTXF0_TX0FD_POS)
#define  OTG_HS_DIEPTXF0_TX0FD(x)          (((uint32_t)    x   << OTG_HS_DIEPTXF0_TX0FD_POS) & OTG_HS_DIEPTXF0_TX0FD_MSK)

// OTG_HS Host non-periodic transmit FIFO/queue status register (OTG_HS_HNPTXSTS)
#define  OTG_HS_HNPTXSTS_NPTXFSAV_POS       ((uint32_t)           0U)
#define  OTG_HS_HNPTXSTS_NPTXFSAV_MSK       ((uint32_t)0xFFFFU      )
#define  OTG_HS_HNPTXSTS_NPTXFSAV(x)       (((uint32_t)    x        ) & OTG_HS_HNPTXSTS_NPTXFSAV_MSK)
#define  OTG_HS_HNPTXSTS_NPTQXSAV_POS       ((uint32_t)           16U)
#define  OTG_HS_HNPTXSTS_NPTQXSAV_MSK       ((uint32_t) 0xFFU  << OTG_HS_HNPTXSTS_NPTQXSAV_POS)
#define  OTG_HS_HNPTXSTS_NPTQXSAV(x)       (((uint32_t)    x   << OTG_HS_HNPTXSTS_NPTQXSAV_POS) & OTG_HS_HNPTXSTS_NPTQXSAV_MSK)
#define  OTG_HS_HNPTXSTS_NPTXQTOP_POS       ((uint32_t)           24U)
#define  OTG_HS_HNPTXSTS_NPTXQTOP_MSK       ((uint32_t) 0x7FU  << OTG_HS_HNPTXSTS_NPTXQTOP_POS)
#define  OTG_HS_HNPTXSTS_NPTXQTOP(x)       (((uint32_t)    x   << OTG_HS_HNPTXSTS_NPTXQTOP_POS) & OTG_HS_HNPTXSTS_NPTXQTOP_MSK)

// OTG_HS I2C access register (OTG_HS_GI2CCTL)
#define  OTG_HS_GI2CCTL_RWDATA_POS          ((uint32_t)           0U)
#define  OTG_HS_GI2CCTL_RWDATA_MSK          ((uint32_t) 0xFFU       )
#define  OTG_HS_GI2CCTL_RWDATA(x)          (((uint32_t)    x        ) & OTG_HS_GI2CCTL_RWDATA_MSK)
#define  OTG_HS_GI2CCTL_REGADDR_POS         ((uint32_t)           8U)
#define  OTG_HS_GI2CCTL_REGADDR_MSK         ((uint32_t) 0xFFU  << OTG_HS_GI2CCTL_REGADDR_POS)
#define  OTG_HS_GI2CCTL_REGADDR(x)         (((uint32_t)    x   << OTG_HS_GI2CCTL_REGADDR_POS) & OTG_HS_GI2CCTL_REGADDR_MSK)
#define  OTG_HS_GI2CCTL_ADDR_POS            ((uint32_t)           16U)
#define  OTG_HS_GI2CCTL_ADDR_MSK            ((uint32_t) 0x7FU  << OTG_HS_GI2CCTL_ADDR_POS)
#define  OTG_HS_GI2CCTL_ADDR(x)            (((uint32_t)    x   << OTG_HS_GI2CCTL_ADDR_POS) & OTG_HS_GI2CCTL_ADDR_MSK)
#define  OTG_HS_GI2CCTL_I2CEN               ((uint32_t)    1U  << 23)
#define  OTG_HS_GI2CCTL_ACK                 ((uint32_t)    1U  << 24)
#define  OTG_HS_GI2CCTL_I2CDEVADR_POS       ((uint32_t)           26U)
#define  OTG_HS_GI2CCTL_I2CDEVADR_MSK       ((uint32_t)    3U  << OTG_HS_GI2CCTL_I2CDEVADR_POS)
#define  OTG_HS_GI2CCTL_I2CDEVADR(x)       (((uint32_t)    x   << OTG_HS_GI2CCTL_I2CDEVADR_POS) & OTG_HS_GI2CCTL_I2CDEVADR_MSK)
#define  OTG_HS_GI2CCTL_I2CDATSE0           ((uint32_t)    1U  << 28)
#define  OTG_HS_GI2CCTL_RW                  ((uint32_t)    1U  << 30)
#define  OTG_HS_GI2CCTL_BSYDNE              ((uint32_t)    1U  << 31)

// OTG_HS general core configuration register (OTG_HS_GCCFG)
#define  OTG_HS_GCCFG_PWRDWN                ((uint32_t)    1U  << 16)
#define  OTG_HS_GCCFG_VBDEN                 ((uint32_t)    1U  << 21)

// OTG_HS core LPM configuration register (OTG_HS_GLPMCFG)
#define  OTG_HS_GLPMCFG_LPMEN               ((uint32_t)    1U       )
#define  OTG_HS_GLPMCFG_LPMACK              ((uint32_t)    1U  <<  1)
#define  OTG_HS_GLPMCFG_BESL_POS            ((uint32_t)           2U)
#define  OTG_HS_GLPMCFG_BESL_MSK            ((uint32_t)  0x0FU << OTG_HS_GLPMCFG_BESL_POS)
#define  OTG_HS_GLPMCFG_BESL(x)            (((uint32_t)    x   << OTG_HS_GLPMCFG_BESL_POS) & OTG_HS_GLPMCFG_BESL_MSK)
#define  OTG_HS_GLPMCFG_REMWAKE             ((uint32_t)    1U  <<  6)
#define  OTG_HS_GLPMCFG_L1SSEN              ((uint32_t)    1U  <<  7)
#define  OTG_HS_GLPMCFG_BESLTHRS_POS        ((uint32_t)           8U)
#define  OTG_HS_GLPMCFG_BESLTHRS_MSK        ((uint32_t)  0x0FU << OTG_HS_GLPMCFG_BESLTHRS_POS)
#define  OTG_HS_GLPMCFG_BESLTHRS(x)        (((uint32_t)    x   << OTG_HS_GLPMCFG_BESLTHRS_POS) & OTG_HS_GLPMCFG_BESLTHRS_MSK)
#define  OTG_HS_GLPMCFG_L1DSEN              ((uint32_t)    1U  << 12)
#define  OTG_HS_GLPMCFG_LPMRSP_POS          ((uint32_t)           13U)
#define  OTG_HS_GLPMCFG_LPMRSP_MSK          ((uint32_t)    3U  << OTG_HS_GLPMCFG_LPMRSP_POS)
#define  OTG_HS_GLPMCFG_LPMRSP(x)          (((uint32_t)    x   << OTG_HS_GLPMCFG_LPMRSP_POS) & OTG_HS_GLPMCFG_LPMRSP_MSK)
#define  OTG_HS_GLPMCFG_SLPSTS              ((uint32_t)    1U  << 15)
#define  OTG_HS_GLPMCFG_L1RSMOK             ((uint32_t)    1U  << 16)
#define  OTG_HS_GLPMCFG_LPMCHIDX_POS        ((uint32_t)           17U)
#define  OTG_HS_GLPMCFG_LPMCHIDX_MSK        ((uint32_t) 0x0FU  << OTG_HS_GLPMCFG_LPMCHIDX_POS)
#define  OTG_HS_GLPMCFG_LPMCHIDX(x)        (((uint32_t)    x   << OTG_HS_GLPMCFG_LPMCHIDX_POS) & OTG_HS_GLPMCFG_LPMCHIDX_MSK)
#define  OTG_HS_GLPMCFG_LPMRCNT_POS         ((uint32_t)           21U)
#define  OTG_HS_GLPMCFG_LPMRCNT_MSK         ((uint32_t)    7U  << OTG_HS_GLPMCFG_LPMRCNT_POS)
#define  OTG_HS_GLPMCFG_LPMRCNT(x)         (((uint32_t)    x   << OTG_HS_GLPMCFG_LPMRCNT_POS) & OTG_HS_GLPMCFG_LPMRCNT)
#define  OTG_HS_GLPMCFG_SNDLPM              ((uint32_t)    1U  << 24)
#define  OTG_HS_GLPMCFG_LPMRCNTSTS_POS      ((uint32_t)           25U)
#define  OTG_HS_GLPMCFG_LPMRCNTSTS_MSK      ((uint32_t)    7U  << OTG_HS_GLPMCFG_LPMRCNTSTS_POS)
#define  OTG_HS_GLPMCFG_LPMRCNTSTS(x)      (((uint32_t)    x   << OTG_HS_GLPMCFG_LPMRCNTSTS_POS) & OTG_HS_GLPMCFG_LPMRCNTSTS_MSK)
#define  OTG_HS_GLPMCFG_ENBESL              ((uint32_t)    1U  << 28)

// OTG_HS Host periodic transmit FIFO size register (OTG_HS_HPTXFSIZ)
#define  OTG_HS_HPTXFSIZ_PTXSA_POS          ((uint32_t)           0U)
#define  OTG_HS_HPTXFSIZ_PTXSA_MSK          ((uint32_t)0xFFFFU      )
#define  OTG_HS_HPTXFSIZ_PTXSA(x)          (((uint32_t)    x        ) & OTG_HS_HPTXFSIZ_PTXSA_MSK)
#define  OTG_HS_HPTXFSIZ_PTXFD_POS          ((uint32_t)           16U)
#define  OTG_HS_HPTXFSIZ_PTXFD_MSK          ((uint32_t)0xFFFFU << OTG_HS_HPTXFSIZ_PTXFD_POS)
#define  OTG_HS_HPTXFSIZ_PTXFD(x)          (((uint32_t)    x   << OTG_HS_HPTXFSIZ_PTXFD_POS) & OTG_HS_HPTXFSIZ_PTXFD_MSK)

// OTG_HS device IN endpoint transmit FIFO size register (OTG_HS_DIEPTXFx)
#define  OTG_HS_DIEPTXFx_INEPTXSA_POS       ((uint32_t)           0U)
#define  OTG_HS_DIEPTXFx_INEPTXSA_MSK       ((uint32_t)0xFFFFU      )
#define  OTG_HS_DIEPTXFx_INEPTXSA(x)       (((uint32_t)    x        ) & OTG_HS_DIEPTXFx_INEPTXSA_MSK)
#define  OTG_HS_DIEPTXFx_INEPTXFD_POS       ((uint32_t)           16U)
#define  OTG_HS_DIEPTXFx_INEPTXFD_MSK       ((uint32_t)0xFFFFU << OTG_HS_DIEPTXFx_INEPTXFD_POS)
#define  OTG_HS_DIEPTXFx_INEPTXFD(x)       (((uint32_t)    x   << OTG_HS_DIEPTXFx_INEPTXFD_POS) & OTG_HS_DIEPTXFx_INEPTXFD_MSK)

// OTG_HS Host configuration register (OTG_HS_HCFG)
#define  OTG_HS_HCFG_FSLSPCS_POS            ((uint32_t)           0U)
#define  OTG_HS_HCFG_FSLSPCS_MSK            ((uint32_t)    3U       )
#define  OTG_HS_HCFG_FSLSPCS(x)            (((uint32_t)    x        ) & OTG_HS_HCFG_FSLSPCS_MSK)
#define  OTG_HS_HCFG_FSLSS                  ((uint32_t)    1U  <<  2)

// OTG_HS Host frame interval register (OTG_HS_HFIR)
#define  OTG_HS_HFIR_FRIVL_POS              ((uint32_t)           0U)
#define  OTG_HS_HFIR_FRIVL_MSK              ((uint32_t)0xFFFFU      )
#define  OTG_HS_HFIR_FRIVL(x)              (((uint32_t)    x        ) & OTG_HS_HFIR_FRIVL_MSK)
#define  OTG_HS_HFIR_RLDCTRL                ((uint32_t)    1U  << 16)

// OTG_HS Host frame number/frame time remaining register (OTG_HS_HFNUM)
#define  OTG_HS_HFNUM_FRNUM_POS             ((uint32_t)           0U)
#define  OTG_HS_HFNUM_FRNUM_MSK             ((uint32_t)0xFFFFU      )
#define  OTG_HS_HFNUM_FRNUM(x)             (((uint32_t)    x        ) & OTG_HS_HFNUM_FRNUM_MSK)
#define  OTG_HS_HFNUM_FTREM_POS             ((uint32_t)           16U)
#define  OTG_HS_HFNUM_FTREM_MSK             ((uint32_t)0xFFFFU << OTG_HS_HFNUM_FRNUM_POS)
#define  OTG_HS_HFNUM_FTREM(x)             (((uint32_t)    x   << OTG_HS_HFNUM_FRNUM_POS) & OTG_HS_HFNUM_FRNUM_MSK)

// OTG_HS Host periodic transmit FIFO/queue status register (OTG_HS_HPTXSTS)
#define  OTG_HS_HPTXSTS_PTXFSAVL_POS        ((uint32_t)           0U)
#define  OTG_HS_HPTXSTS_PTXFSAVL_MSK        ((uint32_t)0xFFFFU      )
#define  OTG_HS_HPTXSTS_PTXFSAVL(x)        (((uint32_t)    x        ) & OTG_HS_HPTXSTS_PTXFSAVL_MSK)
#define  OTG_HS_HPTXSTS_PTXQSAV_POS         ((uint32_t)           16U)
#define  OTG_HS_HPTXSTS_PTXQSAV_MSK         ((uint32_t) 0xFFU  << OTG_HS_HPTXSTS_PTXQSAV_POS)
#define  OTG_HS_HPTXSTS_PTXQSAV(x)         (((uint32_t)    x   << OTG_HS_HPTXSTS_PTXQSAV_POS) & OTG_HS_HPTXSTS_PTXQSAV_MSK)
#define  OTG_HS_HPTXSTS_PTXQTOP_POS         ((uint32_t)           24U)
#define  OTG_HS_HPTXSTS_PTXQTOP_MSK         ((uint32_t) 0xFFU  << OTG_HS_HPTXSTS_PTXQTOP_POS)
#define  OTG_HS_HPTXSTS_PTXQTOP(x)         (((uint32_t)    x   << OTG_HS_HPTXSTS_PTXQTOP_POS) & OTG_HS_HPTXSTS_PTXQTOP_MSK)

// OTG_HS Host all channels interrupt register (OTG_HS_HAINT)
#define  OTG_HS_HAINT_HAINT_POS             ((uint32_t)           0U)
#define  OTG_HS_HAINT_HAINT_MSK             ((uint32_t)0xFFFFU      )
#define  OTG_HS_HAINT_HAINT(x)             (((uint32_t)    x        ) & OTG_HS_HAINT_HAINT_MSK)

