xpacks/stm32f7-cmsis/CMSIS/Driver/OTG_HS_STM32F7xx.h
// OTG_HS device IN endpoint 0 transfer size register (OTG_HS_DIEPTSIZ0)
#define  OTG_HS_DIEPTSIZ0_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_HS_DIEPTSIZ0_XFRSIZ_MSK        ((uint32_t) 0x7FU       )
#define  OTG_HS_DIEPTSIZ0_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_HS_DIEPTSIZ0_XFRSIZ_MSK)
#define  OTG_HS_DIEPTSIZ0_PKTCNT_POS        ((uint32_t)          19U)
#define  OTG_HS_DIEPTSIZ0_PKTCNT_MSK        ((uint32_t)    3U  << OTG_HS_DIEPTSIZ0_PKTCNT_POS)
#define  OTG_HS_DIEPTSIZ0_PKTCNT(x)        (((uint32_t)    x   << OTG_HS_DIEPTSIZ0_PKTCNT_POS) & OTG_HS_DIEPTSIZ0_PKTCNT_MSK)

// OTG_HS device OUT endpoint 0 transfer size register (OTG_HS_DOEPTSIZ0)
#define  OTG_HS_DOEPTSIZ0_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_HS_DOEPTSIZ0_XFRSIZ_MSK        ((uint32_t) 0x7FU       )
#define  OTG_HS_DOEPTSIZ0_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_HS_DOEPTSIZ0_XFRSIZ_MSK)
#define  OTG_HS_DOEPTSIZ0_PKTCNT            ((uint32_t)    1U  << 19)
#define  OTG_HS_DOEPTSIZ0_STUPCNT_POS       ((uint32_t)           29U)
#define  OTG_HS_DOEPTSIZ0_STUPCNT_MSK       ((uint32_t)    3U  << OTG_HS_DOEPTSIZ0_STUPCNT_POS)
#define  OTG_HS_DOEPTSIZ0_STUPCNT(x)       (((uint32_t)    x   << OTG_HS_DOEPTSIZ0_STUPCNT_POS) & OTG_HS_DOEPTSIZ0_STUPCNT_MSK)

// OTG_HS device IN endpoints transver size register (OTG_HS_DIEPTSIZx)
#define  OTG_HS_DIEPTSIZx_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_HS_DIEPTSIZx_XFRSIZ_MSK        ((uint32_t)0x7FFFFU     )
#define  OTG_HS_DIEPTSIZx_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_HS_DIEPTSIZx_XFRSIZ_MSK)
#define  OTG_HS_DIEPTSIZx_PKTCNT_POS        ((uint32_t)           19U)
#define  OTG_HS_DIEPTSIZx_PKTCNT_MSK        ((uint32_t)0x3FFU  << OTG_HS_DIEPTSIZx_PKTCNT_POS)
#define  OTG_HS_DIEPTSIZx_PKTCNT(x)        (((uint32_t)    x   << OTG_HS_DIEPTSIZx_PKTCNT_POS) & OTG_HS_DIEPTSIZx_PKTCNT_MSK)
#define  OTG_HS_DIEPTSIZx_MCNT_POS          ((uint32_t)           29U)
#define  OTG_HS_DIEPTSIZx_MCNT_MSK          ((uint32_t)    3U  << OTG_HS_DIEPTSIZx_MCNT_POS)
#define  OTG_HS_DIEPTSIZx_MCNT(x)          (((uint32_t)    x   << OTG_HS_DIEPTSIZx_MCNT_POS) & OTG_HS_DIEPTSIZx_MCNT_MSK)

// OTG_HS device IN endpoint transmit FIFO status register (OTG_HS_DTXFSTSx)
#define  OTG_HS_DTXFSTSx_INEPTFSAV_POS      ((uint32_t)           0U)
#define  OTG_HS_DTXFSTSx_INEPTFSAV_MSK      ((uint32_t)0xFFFFU      )
#define  OTG_HS_DTXFSTSx_INEPTFSAV(x)      (((uint32_t)    x        ) & OTG_HS_DTXFSTSx_INEPTFSAV_MSK)

// OTG_HS device OUT endpoint-x transfer size register (OTG_HS_DOEPTSIZx)
#define  OTG_HS_DOEPTSIZx_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_HS_DOEPTSIZx_XFRSIZ_MSK        ((uint32_t)0x7FFFFU     )
#define  OTG_HS_DOEPTSIZx_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_HS_DOEPTSIZx_XFRSIZ_MSK)
#define  OTG_HS_DOEPTSIZx_PKTCNT_POS        ((uint32_t)           19U)
#define  OTG_HS_DOEPTSIZx_PKTCNT_MSK        ((uint32_t)0x3FFU  << OTG_HS_DOEPTSIZx_PKTCNT_POS)
#define  OTG_HS_DOEPTSIZx_PKTCNT(x)        (((uint32_t)    x   << OTG_HS_DOEPTSIZx_PKTCNT_POS) & OTG_HS_DOEPTSIZx_PKTCNT_MSK)
#define  OTG_HS_DOEPTSIZx_RXDPID_POS        ((uint32_t)           29U)
#define  OTG_HS_DOEPTSIZx_RXDPID_MSK        ((uint32_t)    3U  << OTG_HS_DOEPTSIZx_RXDPID_POS)
#define  OTG_HS_DOEPTSIZx_RXDPID(x)        (((uint32_t)    x   << OTG_HS_DOEPTSIZx_RXDPID_POS) & OTG_HS_DOEPTSIZx_RXDPID_MSK)
#define  OTG_HS_DOEPTSIZx_STUPCNT_POS       ((uint32_t)           29U)
#define  OTG_HS_DOEPTSIZx_STUPCNT_MSK       ((uint32_t)    3U  << OTG_HS_DOEPTSIZx_STUPCNT_POS)
#define  OTG_HS_DOEPTSIZx_STUPCNT(x)       (((uint32_t)    x   << OTG_HS_DOEPTSIZx_STUPCNT_POS) & OTG_HS_DOEPTSIZx_STUPCNT_MSK)

// OTG_HS power and gate clock gating control register (OTG_HS_PCGCCTL)
#define  OTG_HS_PCGCCTL_STPPCLK             ((uint32_t)    1U       )
#define  OTG_HS_PCGCCTL_GATEHCLK            ((uint32_t)    1U  <<  1)
#define  OTG_HS_PCGCCTL_PHYSUSP             ((uint32_t)    1U  <<  4)
#define  OTG_HS_PCGCCTL_ENL1GTG             ((uint32_t)    1U  <<  5)
#define  OTG_HS_PCGCCTL_PHYSLEEP            ((uint32_t)    1U  <<  6)
#define  OTG_HS_PCGCCTL_SUSP                ((uint32_t)    1U  <<  7)
